; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	image3 - mode
	thermograph1 - mode
	infrared0 - mode
	thermograph2 - mode
	infrared4 - mode
	Star1 - direction
	Star3 - direction
	Star24 - direction
	GroundStation28 - direction
	Star32 - direction
	Star36 - direction
	Star42 - direction
	GroundStation44 - direction
	Star35 - direction
	Star49 - direction
	GroundStation11 - direction
	Star40 - direction
	Star12 - direction
	Star7 - direction
	Star41 - direction
	Star10 - direction
	GroundStation45 - direction
	GroundStation34 - direction
	GroundStation13 - direction
	GroundStation0 - direction
	Star14 - direction
	GroundStation22 - direction
	GroundStation27 - direction
	GroundStation46 - direction
	GroundStation4 - direction
	Star23 - direction
	GroundStation31 - direction
	Star6 - direction
	Star15 - direction
	GroundStation17 - direction
	GroundStation37 - direction
	Star33 - direction
	GroundStation43 - direction
	Star21 - direction
	GroundStation26 - direction
	GroundStation29 - direction
	GroundStation20 - direction
	Star16 - direction
	Star19 - direction
	Star48 - direction
	GroundStation18 - direction
	GroundStation2 - direction
	Star5 - direction
	GroundStation47 - direction
	GroundStation39 - direction
	GroundStation30 - direction
	Star25 - direction
	GroundStation38 - direction
	GroundStation8 - direction
	Star9 - direction
	Planet50 - direction
	Planet51 - direction
	Phenomenon52 - direction
	Star53 - direction
	Phenomenon54 - direction
	Planet55 - direction
	Planet56 - direction
	Phenomenon57 - direction
	Star58 - direction
	Phenomenon59 - direction
	Planet60 - direction
	Phenomenon61 - direction
	Star62 - direction
	Star63 - direction
	Star64 - direction
	Star65 - direction
	Planet66 - direction
	Star67 - direction
	Planet68 - direction
	Phenomenon69 - direction
	Phenomenon70 - direction
	Phenomenon71 - direction
	Planet72 - direction
	Star73 - direction
	Phenomenon74 - direction
	Star75 - direction
	Phenomenon76 - direction
	Phenomenon77 - direction
	Star78 - direction
	Planet79 - direction
	Phenomenon80 - direction
	Star81 - direction
	Star82 - direction
	Phenomenon83 - direction
	Star84 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 infrared4)
	(calibration_target instrument0 GroundStation45)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation34)
	(calibration_target instrument0 GroundStation17)
	(calibration_target instrument0 Star33)
	(calibration_target instrument0 Star49)
	(calibration_target instrument0 GroundStation30)
	(calibration_target instrument0 GroundStation29)
	(calibration_target instrument0 Star35)
	(calibration_target instrument0 Star40)
	(calibration_target instrument0 GroundStation43)
	(calibration_target instrument0 Star41)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star62)
	(supports instrument1 infrared4)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star16)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 GroundStation27)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation22)
	(calibration_target instrument1 GroundStation30)
	(calibration_target instrument1 Star40)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation43)
	(calibration_target instrument1 Star41)
	(calibration_target instrument1 Star33)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation34)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star15)
	(calibration_target instrument2 GroundStation22)
	(calibration_target instrument2 GroundStation31)
	(calibration_target instrument2 Star23)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation45)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 Star41)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation46)
	(calibration_target instrument2 GroundStation17)
	(calibration_target instrument2 Star16)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation31)
	(calibration_target instrument3 Star23)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 GroundStation47)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation46)
	(calibration_target instrument3 GroundStation27)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 GroundStation22)
	(calibration_target instrument3 Star14)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation13)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation30)
	(calibration_target instrument4 GroundStation38)
	(calibration_target instrument4 GroundStation31)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation26)
	(supports instrument5 image3)
	(supports instrument5 infrared0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 GroundStation26)
	(calibration_target instrument5 Star21)
	(calibration_target instrument5 GroundStation38)
	(calibration_target instrument5 GroundStation43)
	(calibration_target instrument5 Star33)
	(calibration_target instrument5 GroundStation37)
	(calibration_target instrument5 GroundStation17)
	(calibration_target instrument5 Star15)
	(calibration_target instrument5 Star6)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star25)
	(supports instrument6 thermograph1)
	(supports instrument6 image3)
	(calibration_target instrument6 Star16)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star49)
	(supports instrument7 image3)
	(calibration_target instrument7 Star9)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 GroundStation38)
	(calibration_target instrument7 Star25)
	(calibration_target instrument7 GroundStation30)
	(calibration_target instrument7 GroundStation39)
	(calibration_target instrument7 GroundStation47)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 GroundStation18)
	(calibration_target instrument7 Star48)
	(calibration_target instrument7 Star19)
	(calibration_target instrument7 Star16)
	(calibration_target instrument7 GroundStation20)
	(calibration_target instrument7 GroundStation29)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star12)
)
(:goal (and
	(pointing satellite2 Planet60)
	(have_image Planet50 thermograph1)
	(have_image Planet51 image3)
	(have_image Phenomenon52 image3)
	(have_image Star53 thermograph2)
	(have_image Phenomenon54 thermograph2)
	(have_image Planet55 infrared0)
	(have_image Planet56 infrared0)
	(have_image Phenomenon57 thermograph2)
	(have_image Star58 infrared4)
	(have_image Phenomenon59 infrared4)
	(have_image Planet60 infrared0)
	(have_image Phenomenon61 image3)
	(have_image Star62 thermograph2)
	(have_image Star63 infrared4)
	(have_image Star64 infrared4)
	(have_image Star65 infrared0)
	(have_image Planet66 thermograph2)
	(have_image Star67 image3)
	(have_image Planet68 thermograph1)
	(have_image Phenomenon69 infrared0)
	(have_image Phenomenon70 thermograph2)
	(have_image Phenomenon71 thermograph1)
	(have_image Planet72 thermograph1)
	(have_image Star73 infrared4)
	(have_image Phenomenon74 infrared4)
	(have_image Star75 infrared4)
	(have_image Phenomenon76 infrared0)
	(have_image Phenomenon77 thermograph2)
	(have_image Star78 infrared4)
	(have_image Planet79 infrared0)
	(have_image Phenomenon80 thermograph1)
	(have_image Star81 infrared0)
	(have_image Star82 thermograph1)
	(have_image Phenomenon83 infrared4)
	(have_image Star84 thermograph1)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 36
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 36
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 36
4. (turn_to satellite2 groundstation38 star25)
   deleted: (pointing satellite2 star25)
   added: (pointing satellite2 groundstation38)
   goals met: 0 of 36
5. (calibrate satellite2 instrument4 groundstation38)
   added: (calibrated instrument4)
   goals met: 0 of 36
6. (turn_to satellite2 phenomenon69 groundstation38)
   deleted: (pointing satellite2 groundstation38)
   added: (pointing satellite2 phenomenon69)
   goals met: 0 of 36
7. (take_image satellite2 phenomenon69 instrument4 infrared0)
   added: (have_image phenomenon69 infrared0)
   goals met: 1 of 36
8. (turn_to satellite2 phenomenon71 phenomenon69)
   deleted: (pointing satellite2 phenomenon69)
   added: (pointing satellite2 phenomenon71)
   goals met: 1 of 36
9. (take_image satellite2 phenomenon71 instrument4 thermograph1)
   added: (have_image phenomenon71 thermograph1)
   goals met: 2 of 36
10. (turn_to satellite2 phenomenon76 phenomenon71)
   deleted: (pointing satellite2 phenomenon71)
   added: (pointing satellite2 phenomenon76)
   goals met: 2 of 36
11. (take_image satellite2 phenomenon76 instrument4 infrared0)
   added: (have_image phenomenon76 infrared0)
   goals met: 3 of 36
12. (turn_to satellite2 phenomenon80 phenomenon76)
   deleted: (pointing satellite2 phenomenon76)
   added: (pointing satellite2 phenomenon80)
   goals met: 3 of 36
13. (take_image satellite2 phenomenon80 instrument4 thermograph1)
   added: (have_image phenomenon80 thermograph1)
   goals met: 4 of 36
14. (turn_to satellite2 planet50 phenomenon80)
   deleted: (pointing satellite2 phenomenon80)
   added: (pointing satellite2 planet50)
   goals met: 4 of 36
15. (take_image satellite2 planet50 instrument4 thermograph1)
   added: (have_image planet50 thermograph1)
   goals met: 5 of 36
16. (turn_to satellite2 planet55 planet50)
   deleted: (pointing satellite2 planet50)
   added: (pointing satellite2 planet55)
   goals met: 5 of 36
17. (take_image satellite2 planet55 instrument4 infrared0)
   added: (have_image planet55 infrared0)
   goals met: 6 of 36
18. (turn_to satellite2 planet56 planet55)
   deleted: (pointing satellite2 planet55)
   added: (pointing satellite2 planet56)
   goals met: 6 of 36
19. (take_image satellite2 planet56 instrument4 infrared0)
   added: (have_image planet56 infrared0)
   goals met: 7 of 36
20. (turn_to satellite2 planet60 planet56)
   deleted: (pointing satellite2 planet56)
   added: (pointing satellite2 planet60)
   goals met: 8 of 36
21. (take_image satellite2 planet60 instrument4 infrared0)
   added: (have_image planet60 infrared0)
   goals met: 9 of 36
22. (turn_to satellite1 phenomenon52 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon52)
   goals met: 9 of 36
23. (turn_to satellite2 planet68 planet60)
   deleted: (pointing satellite2 planet60)
   added: (pointing satellite2 planet68)
   goals met: 8 of 36
24. (take_image satellite2 planet68 instrument4 thermograph1)
   added: (have_image planet68 thermograph1)
   goals met: 9 of 36
25. (turn_to satellite2 planet60 planet68)
   deleted: (pointing satellite2 planet68)
   added: (pointing satellite2 planet60)
   goals met: 10 of 36
26. (turn_to satellite2 planet72 planet60)
   deleted: (pointing satellite2 planet60)
   added: (pointing satellite2 planet72)
   goals met: 9 of 36
27. (take_image satellite2 planet72 instrument4 thermograph1)
   added: (have_image planet72 thermograph1)
   goals met: 10 of 36
28. (turn_to satellite2 planet60 planet72)
   deleted: (pointing satellite2 planet72)
   added: (pointing satellite2 planet60)
   goals met: 11 of 36
29. (turn_to satellite2 planet79 planet60)
   deleted: (pointing satellite2 planet60)
   added: (pointing satellite2 planet79)
   goals met: 10 of 36
30. (take_image satellite2 planet79 instrument4 infrared0)
   added: (have_image planet79 infrared0)
   goals met: 11 of 36
31. (turn_to satellite2 planet60 planet79)
   deleted: (pointing satellite2 planet79)
   added: (pointing satellite2 planet60)
   goals met: 12 of 36
32. (turn_to satellite2 star65 planet60)
   deleted: (pointing satellite2 planet60)
   added: (pointing satellite2 star65)
   goals met: 11 of 36
33. (take_image satellite2 star65 instrument4 infrared0)
   added: (have_image star65 infrared0)
   goals met: 12 of 36
34. (turn_to satellite2 planet60 star65)
   deleted: (pointing satellite2 star65)
   added: (pointing satellite2 planet60)
   goals met: 13 of 36
35. (turn_to satellite2 star81 planet60)
   deleted: (pointing satellite2 planet60)
   added: (pointing satellite2 star81)
   goals met: 12 of 36
36. (take_image satellite2 star81 instrument4 infrared0)
   added: (have_image star81 infrared0)
   goals met: 13 of 36
37. (turn_to satellite2 planet60 star81)
   deleted: (pointing satellite2 star81)
   added: (pointing satellite2 planet60)
   goals met: 14 of 36
38. (turn_to satellite2 star82 planet60)
   deleted: (pointing satellite2 planet60)
   added: (pointing satellite2 star82)
   goals met: 13 of 36
39. (take_image satellite2 star82 instrument4 thermograph1)
   added: (have_image star82 thermograph1)
   goals met: 14 of 36
40. (turn_to satellite2 planet60 star82)
   deleted: (pointing satellite2 star82)
   added: (pointing satellite2 planet60)
   goals met: 15 of 36
41. (turn_to satellite2 star84 planet60)
   deleted: (pointing satellite2 planet60)
   added: (pointing satellite2 star84)
   goals met: 14 of 36
42. (take_image satellite2 star84 instrument4 thermograph1)
   added: (have_image star84 thermograph1)
   goals met: 15 of 36
43. (turn_to satellite2 planet60 star84)
   deleted: (pointing satellite2 star84)
   added: (pointing satellite2 planet60)
   goals met: 16 of 36
44. (turn_to satellite1 star7 phenomenon52)
   deleted: (pointing satellite1 phenomenon52)
   added: (pointing satellite1 star7)
   goals met: 16 of 36
45. (calibrate satellite1 instrument2 star7)
   added: (calibrated instrument2)
   goals met: 16 of 36
46. (turn_to satellite1 phenomenon52 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon52)
   goals met: 16 of 36
47. (take_image satellite1 phenomenon52 instrument2 image3)
   added: (have_image phenomenon52 image3)
   goals met: 17 of 36
48. (turn_to satellite1 phenomenon61 phenomenon52)
   deleted: (pointing satellite1 phenomenon52)
   added: (pointing satellite1 phenomenon61)
   goals met: 17 of 36
49. (take_image satellite1 phenomenon61 instrument2 image3)
   added: (have_image phenomenon61 image3)
   goals met: 18 of 36
50. (turn_to satellite1 planet51 phenomenon61)
   deleted: (pointing satellite1 phenomenon61)
   added: (pointing satellite1 planet51)
   goals met: 18 of 36
51. (take_image satellite1 planet51 instrument2 image3)
   added: (have_image planet51 image3)
   goals met: 19 of 36
52. (turn_to satellite1 star67 planet51)
   deleted: (pointing satellite1 planet51)
   added: (pointing satellite1 star67)
   goals met: 19 of 36
53. (take_image satellite1 star67 instrument2 image3)
   added: (have_image star67 image3)
   goals met: 20 of 36
54. (turn_to satellite0 star49 star62)
   deleted: (pointing satellite0 star62)
   added: (pointing satellite0 star49)
   goals met: 20 of 36
55. (calibrate satellite0 instrument0 star49)
   added: (calibrated instrument0)
   goals met: 20 of 36
56. (turn_to satellite0 phenomenon54 star49)
   deleted: (pointing satellite0 star49)
   added: (pointing satellite0 phenomenon54)
   goals met: 20 of 36
57. (take_image satellite0 phenomenon54 instrument0 thermograph2)
   added: (have_image phenomenon54 thermograph2)
   goals met: 21 of 36
58. (turn_to satellite0 phenomenon57 phenomenon54)
   deleted: (pointing satellite0 phenomenon54)
   added: (pointing satellite0 phenomenon57)
   goals met: 21 of 36
59. (take_image satellite0 phenomenon57 instrument0 thermograph2)
   added: (have_image phenomenon57 thermograph2)
   goals met: 22 of 36
60. (turn_to satellite0 phenomenon59 phenomenon57)
   deleted: (pointing satellite0 phenomenon57)
   added: (pointing satellite0 phenomenon59)
   goals met: 22 of 36
61. (take_image satellite0 phenomenon59 instrument0 infrared4)
   added: (have_image phenomenon59 infrared4)
   goals met: 23 of 36
62. (turn_to satellite0 phenomenon70 phenomenon59)
   deleted: (pointing satellite0 phenomenon59)
   added: (pointing satellite0 phenomenon70)
   goals met: 23 of 36
63. (take_image satellite0 phenomenon70 instrument0 thermograph2)
   added: (have_image phenomenon70 thermograph2)
   goals met: 24 of 36
64. (turn_to satellite0 phenomenon74 phenomenon70)
   deleted: (pointing satellite0 phenomenon70)
   added: (pointing satellite0 phenomenon74)
   goals met: 24 of 36
65. (take_image satellite0 phenomenon74 instrument0 infrared4)
   added: (have_image phenomenon74 infrared4)
   goals met: 25 of 36
66. (turn_to satellite0 phenomenon77 phenomenon74)
   deleted: (pointing satellite0 phenomenon74)
   added: (pointing satellite0 phenomenon77)
   goals met: 25 of 36
67. (take_image satellite0 phenomenon77 instrument0 thermograph2)
   added: (have_image phenomenon77 thermograph2)
   goals met: 26 of 36
68. (turn_to satellite0 phenomenon83 phenomenon77)
   deleted: (pointing satellite0 phenomenon77)
   added: (pointing satellite0 phenomenon83)
   goals met: 26 of 36
69. (take_image satellite0 phenomenon83 instrument0 infrared4)
   added: (have_image phenomenon83 infrared4)
   goals met: 27 of 36
70. (turn_to satellite0 planet66 phenomenon83)
   deleted: (pointing satellite0 phenomenon83)
   added: (pointing satellite0 planet66)
   goals met: 27 of 36
71. (take_image satellite0 planet66 instrument0 thermograph2)
   added: (have_image planet66 thermograph2)
   goals met: 28 of 36
72. (turn_to satellite0 star53 planet66)
   deleted: (pointing satellite0 planet66)
   added: (pointing satellite0 star53)
   goals met: 28 of 36
73. (take_image satellite0 star53 instrument0 thermograph2)
   added: (have_image star53 thermograph2)
   goals met: 29 of 36
74. (turn_to satellite0 star58 star53)
   deleted: (pointing satellite0 star53)
   added: (pointing satellite0 star58)
   goals met: 29 of 36
75. (take_image satellite0 star58 instrument0 infrared4)
   added: (have_image star58 infrared4)
   goals met: 30 of 36
76. (turn_to satellite0 star62 star58)
   deleted: (pointing satellite0 star58)
   added: (pointing satellite0 star62)
   goals met: 30 of 36
77. (take_image satellite0 star62 instrument0 thermograph2)
   added: (have_image star62 thermograph2)
   goals met: 31 of 36
78. (turn_to satellite0 star63 star62)
   deleted: (pointing satellite0 star62)
   added: (pointing satellite0 star63)
   goals met: 31 of 36
79. (take_image satellite0 star63 instrument0 infrared4)
   added: (have_image star63 infrared4)
   goals met: 32 of 36
80. (turn_to satellite0 star64 star63)
   deleted: (pointing satellite0 star63)
   added: (pointing satellite0 star64)
   goals met: 32 of 36
81. (take_image satellite0 star64 instrument0 infrared4)
   added: (have_image star64 infrared4)
   goals met: 33 of 36
82. (turn_to satellite0 star73 star64)
   deleted: (pointing satellite0 star64)
   added: (pointing satellite0 star73)
   goals met: 33 of 36
83. (take_image satellite0 star73 instrument0 infrared4)
   added: (have_image star73 infrared4)
   goals met: 34 of 36
84. (turn_to satellite0 star75 star73)
   deleted: (pointing satellite0 star73)
   added: (pointing satellite0 star75)
   goals met: 34 of 36
85. (take_image satellite0 star75 instrument0 infrared4)
   added: (have_image star75 infrared4)
   goals met: 35 of 36
86. (turn_to satellite0 star78 star75)
   deleted: (pointing satellite0 star75)
   added: (pointing satellite0 star78)
   goals met: 35 of 36
87. (take_image satellite0 star78 instrument0 infrared4)
   added: (have_image star78 infrared4)
   goals met: 36 of 36
